crate::doc_page!(
    "",
    "/zh-Hans/docs/concepts/router",
    Content::new(vec![
        h1!["Router"],
        p![link!(
            "https://crates.io/crates/yew-router",
            "https://crates.io/crates/yew-router"
        )],
        p!["Routers 在单页应用（SPA）中根\\
             u{636e} URL 的不同显示不同的页面\\
             u{3002}当点击一个链接时\\
             u{ff0c}Router 在本地设置 URL 以指向应用程序中有效\\
             u{7684}路由，而不是默认请\\
             u{6c42}一个不同的远程资源\\
             u{3002}然后 Router 检测到此更改后决定要\\
             u{6e32}染的内容。"],
        h2!["核心元素"],
        h3!["Route"],
        p!["包含一个字符串，该字\\
             u{7b26}串表示网址中域名之\\
             u{540e}的所有内容，还可以\\
             u{9009}择表示存储在 history api 中的状态。"],
        h3!["RouteService"],
        p!["与浏览器通信以获取和\\
             u{8bbe}置路由。"],
        h3!["RouteAgent"],
        p!["拥有一个 RouteService，并用于当路由改变\\
             u{65f6}协调更新，无论更新\\
             u{662f}来自应用程序自身逻\\
             u{8f91}还是来自浏览器触发\\
             u{7684}事件。"],
        h3!["Switch"],
        p![
            code("Switch"),
            " trait 用于在该 trait 的实现者之间转换 ",
            code("Route"),
            "。",
        ],
        h3!["Router"],
        p![
            "Router 组件同 ",
            code("RouterAgent"),
            " 进行通信，并自动把\\
                 u{5b83}从 Agent 那里获得的 Routes 解析为 Switches，并通过 ",
            code("render"),
            " 属性暴露该 Switch，该属性允许指定将\\
                 u{751f}成的 Switch 转换为 ",
            code("HTML"),
            " 的方式。",
        ],
        h2!["如何使用 Router"],
        p![
            "首先，你要创建一个表\\
                 u{5f81}你的应用程序所有状\\
                 u{6001}的类型。请注意，虽\\
                 u{7136}这通常是一个枚举，\\
                 u{4f46}也支持结构体，并且\\
                 u{4f60}可以在内部嵌套实现\\
                 u{4e86} ",
            code("Switch"),
            " trait 的其他项。",
        ],
        p![
            "然后你应该为了你创建\\
                 u{7684}类型派生 ",
            code("Switch"),
            "。对于枚举，每一个成\\
                 u{5458}都必须用 ",
            code("#[to = \"/some/route\"]"),
            " 进行标注，如果你使\\
                 u{7528}结构体，则标注必须\\
                 u{51fa}现在结构体声明之外\\
                 u{3002}",
        ],
        p![
            "请注意，由派生宏为 ",
            code("Switch"),
            " 生成的实现，将尝试\\
                 u{4ece}头到尾依次创建每个\\
                 u{6210}员，因此，如果任何\\
                 u{8def}由可能与你指定的两\\
                 u{4e2a} ",
            code("to"),
            " 标注相匹配，那么第\\
                 u{4e00}个会被匹配，第二个\\
                 u{5c06}永远不会被尝试。",
        ],
        p![
            "你还可以在 ",
            code("#[to = \"\"]"),
            " 标注中使用 ",
            code("{}"),
            " 的变体来捕获片段。",
            code("{}"),
            " 表示捕获文本直到下\\
                 u{4e00}个分隔符（根据上下\\
                 u{6587}可能是\"/\"，\"?\"，\"&\" 或 \"\\#\"）。",
            code("{*}"),
            " 表示捕获文本直到后\\
                 u{7eed}字符匹配为止，如果\\
                 u{4e0d}存在任何字符，则它\\
                 u{5c06}匹配任何内容。",
            code("{<number>}"),
            " 表示捕获文本直到遇\\
                 u{5230}指定数目的分隔符为\\
                 u{6b62}（例如：",
            code("{2}"),
            " 将一直捕获文本直到\\
                 u{9047}到两个分隔符为止）\\
                 u{3002}",
        ],
        p![
            "对于具有命名字段的结\\
                 u{6784}体和枚举，你必须在\\
                 u{6355}获组中指定字段的名\\
                 u{79f0}，例如：",
            code("{user_name}"),
            " 或 ",
            code("{*:age}"),
            "。",
        ],
        p![
            "Switch trait 适用于比字符串更结构\\
                 u{5316}的捕获组。你可以指\\
                 u{5b9a}实现了 ",
            code("Switch"),
            " trait 的任何类型。因此，\\
                 u{4f60}可以指定捕获组为 ",
            code("usize"),
            "，并且如果 URL 的捕获部分无法转换为\\
                 u{5b83}，则该成员不会被匹\\
                 u{914d}。",
        ],
    ])
);
